/*Дан односвязный линейный список и указатель на голову списка P1. Значения
элементов списка упорядочены по возрастанию. Необходимо создать копию исходного списка,
после чего во вновь созданном списке вставить в список значение M так, чтобы он остался
упорядоченным и вывести ссылку на первый элемент полученного списка P2


Для каждой динамической структуры должен быть предусмотрен стандартный набор методов -
добавления/удаления/вывода элементов.
Во всех задачах обязательно наличие дружественного интерфейса. Ввод данных с клавиатуры.

*/

#include "list.h"
#include <iostream>

int main() {
    setlocale(LC_ALL, "Russian");
    run_task();
    return 0;
}
